In [36]:
import pandas as pd

In [37]:
df=pd.read_csv('data.csv')

In [38]:
df.tail(5)

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [39]:
df.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.790244
std     42.299949   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [40]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [41]:
df.dtypes

Duration      int64
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object

In [42]:
##HANDLING MISSING VALUES
df.isnull().any()

Duration    False
Pulse       False
Maxpulse    False
Calories     True
dtype: bool

In [43]:
df.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [52]:
df=df.fillna(0)

In [53]:
df.isnull().any()

Duration    False
Pulse       False
Maxpulse    False
Calories    False
dtype: bool

In [54]:
df_filled=df.fillna(0)

In [55]:
df_filled

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [56]:
df_filled.isnull().any()

Duration    False
Pulse       False
Maxpulse    False
Calories    False
dtype: bool

In [57]:
df['Calories_fillNA']=df['Calories'].fillna(df['Calories'].mean())
df

     Duration  Pulse  Maxpulse  Calories  Calories_fillNA
0          60    110       130     409.1            409.1
1          60    117       145     479.0            479.0
2          60    103       135     340.0            340.0
3          45    109       175     282.4            282.4
4          45    117       148     406.0            406.0
..        ...    ...       ...       ...              ...
164        60    105       140     290.8            290.8
165        60    110       145     300.0            300.0
166        60    115       145     310.2            310.2
167        75    120       150     320.4            320.4
168        75    125       150     330.4            330.4

[169 rows x 5 columns]

In [58]:
df.isnull().any()

Duration           False
Pulse              False
Maxpulse           False
Calories           False
Calories_fillNA    False
dtype: bool

In [59]:
df.dtypes

Duration             int64
Pulse                int64
Maxpulse             int64
Calories           float64
Calories_fillNA    float64
dtype: object

In [60]:
df.isnull().sum()

Duration           0
Pulse              0
Maxpulse           0
Calories           0
Calories_fillNA    0
dtype: int64

In [61]:
df.dtypes

Duration             int64
Pulse                int64
Maxpulse             int64
Calories           float64
Calories_fillNA    float64
dtype: object

In [ ]:
## Remaining Columns
df.rename(columns={'Duration' : 'Time'})

     Time  Pulse  Maxpulse  Calories  Calories_fillNA
0      60    110       130     409.1            409.1
1      60    117       145     479.0            479.0
2      60    103       135     340.0            340.0
3      45    109       175     282.4            282.4
4      45    117       148     406.0            406.0
..    ...    ...       ...       ...              ...
164    60    105       140     290.8            290.8
165    60    110       145     300.0            300.0
166    60    115       145     310.2            310.2
167    75    120       150     320.4            320.4
168    75    125       150     330.4            330.4

[169 rows x 5 columns]

In [65]:
df['New_Pulse']=df['Pulse'].astype(float)

In [66]:
df

     Duration  Pulse  Maxpulse  Calories  Calories_fillNA  New_Pulse
0          60    110       130     409.1            409.1      110.0
1          60    117       145     479.0            479.0      117.0
2          60    103       135     340.0            340.0      103.0
3          45    109       175     282.4            282.4      109.0
4          45    117       148     406.0            406.0      117.0
..        ...    ...       ...       ...              ...        ...
164        60    105       140     290.8            290.8      105.0
165        60    110       145     300.0            300.0      110.0
166        60    115       145     310.2            310.2      115.0
167        75    120       150     320.4            320.4      120.0
168        75    125       150     330.4            330.4      125.0

[169 rows x 6 columns]

In [68]:
df['New_Pulse']=df['Pulse'].apply(lambda x:x*2)

In [69]:
df

     Duration  Pulse  Maxpulse  Calories  Calories_fillNA  New_Pulse
0          60    110       130     409.1            409.1        220
1          60    117       145     479.0            479.0        234
2          60    103       135     340.0            340.0        206
3          45    109       175     282.4            282.4        218
4          45    117       148     406.0            406.0        234
..        ...    ...       ...       ...              ...        ...
164        60    105       140     290.8            290.8        210
165        60    110       145     300.0            300.0        220
166        60    115       145     310.2            310.2        230
167        75    120       150     320.4            320.4        240
168        75    125       150     330.4            330.4        250

[169 rows x 6 columns]

In [70]:
## Data Aggregating and Grouping
df.head()

   Duration  Pulse  Maxpulse  Calories  Calories_fillNA  New_Pulse
0        60    110       130     409.1            409.1        220
1        60    117       145     479.0            479.0        234
2        60    103       135     340.0            340.0        206
3        45    109       175     282.4            282.4        218
4        45    117       148     406.0            406.0        234

In [88]:
grouped_mean=df.groupby('Maxpulse',sort=False)['New_Pulse'].mean()
print(grouped_mean.head(5))

Maxpulse
130    201.777778
145    228.000000
135    212.500000
175    245.000000
148    234.000000
Name: New_Pulse, dtype: float64

In [110]:
group_by_two=df.groupby(['Maxpulse','Calories'],sort=False)['New_Pulse'].mean()

In [111]:
group_by_two.head(7)

Maxpulse  Calories
130       409.1       220.0
145       479.0       234.0
135       340.0       206.0
175       282.4       218.0
148       406.0       234.0
127       300.0       204.0
136       374.0       220.0
Name: New_Pulse, dtype: float64

In [116]:
##Aggregate multiple functions
grouped_aggr=df.groupby('Duration',sort=False)['New_Pulse'].agg(['mean','sum','count'])
grouped_aggr.head(8)

                mean    sum  count
Duration
60        212.253165  16768     79
45        214.971429   7524     35
30        219.625000   3514     16
80        246.000000    246      1
20        250.000000   2250      9
210       245.000000    490      2
160       219.000000    438      2
180       187.333333    562      3

In [119]:
##Merging and joining Data Frames
df1=pd.DataFrame({'Key':['A','B','C'],'Value1':[1,2,3]})
df2=pd.DataFrame({'Key':['A','B','D'],'Value1':[4,5,6]})

In [123]:
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [122]:
df2

  Key  Value1
0   A       4
1   B       5
2   D       6

In [124]:
##Merge DataFrame on the 'Key Columns'
df_merged=pd.merge(df1,df2,on="Key",how="inner")
df_merged

  Key  Value1_x  Value1_y
0   A         1         4
1   B         2         5

In [125]:
df_merged=pd.merge(df1,df2,on="Key",how="outer")
df_merged

  Key  Value1_x  Value1_y
0   A       1.0       4.0
1   B       2.0       5.0
2   C       3.0       NaN
3   D       NaN       6.0

In [126]:
df_merged=pd.merge(df1,df2,on="Key",how="left")
df_merged

  Key  Value1_x  Value1_y
0   A         1       4.0
1   B         2       5.0
2   C         3       NaN

In [127]:
df_merged=pd.merge(df1,df2,on="Key",how="right")
df_merged

  Key  Value1_x  Value1_y
0   A       1.0         4
1   B       2.0         5
2   D       NaN         6